[
  {
    "name": "Spaghetti",
    "image_name": "spaghetti.jpg",
    "short_description": "The Classic Tomato Basil Pasta Sauce from Italy",
    "long_description": "Ingredients\n6 oz dry spaghetti\n2 tomatoes (around 10 oz) heirloom varieties work best\n2 cups of fresh basil leaves, de-stemmed\n1 clove of garlic\n1/4 cup extra virgin olive oil (add more if needed)\n1/2 teaspoon chili flakes\nSea salt, to taste\nPecorino cheese shavings, to taste (optional)\nInstructions\nBring a big pot of salted water to a boil. Once boiling, add spaghetti and cook until al dente, stirring occasionally.\nWhile pasta is cooking, finely chop tomatoes and put them in a colander to drain for a few minutes. In this way they will release all the excess moisture, and the sauce won’t come out too watery.\nMince basil and garlic.\nCombine chopped tomatoes, basil and garlic in a bowl.\nAdd olive oil, chili flakes and salt. Mix all the ingredients together and let them rest until spaghetti is cooked.\nWhen the pasta is ready, drain it, combine it with the sauce and serve immediately.\nFinally, if you wish to take this dish to the next level, just add a few shavings of Pecorino cheese on top of your pasta dish.\n",
    "products": [
      84,
      136
    ]
  },
  {
    "name": "Beef with spinach",
    "image_name": "BeefSpinach.jpg",
    "short_description": "Spinach, like most dark leafy greens are eaten daily in the Mediterranean Diet.",
    "long_description": "Ingredients\n1 1/2 lb lean beef, cut into cubes\n1 cup onion, shredded\n1 cup extra virgin olive oil buy now\n10 green onions (scallions), cut into rings\n1 tsp dry mint\n1/2 cup fresh dill, chopped\n1 cup tomatoes, chopped\nsalt and pepper, to taste\n2 lbs spinach\n1 cup water\nInstructions\nIn a deep pot, sauté meat, onions and olive oil for 5 minutes. Stir in green onions, mint, dill, tomatoes, salt and pepper. Simmer for 20 minutes.\nAdd spinach and water. Stir well and cook for an additional 20 minutes, or until meat is tender. Serve warm.",
    "products": [
      30,
      81
    ]
  },
  {
    "name": "Fries",
    "image_name": "fries.jpeg",
    "short_description": "Baked French Fries",
    "long_description": "\nCrispy Air Fryer French Fries\nCrispy Oven Baked Potato Skins\nBaked Sweet Potato Fries\nQuick and Easy French Toast\nCrispy Zucchini Fries (oven baked)\nFrench Toast Roll Ups\nEasy Overnight French Toast\nOven Baked Jicama Fries\nHome > Recipes > Side Dishes > Baked French Fries (Oven Fries)SIDE DISHES\nBaked French Fries (Oven Fries)\n\nby\nHOLLY\n4.92 from 246 votes\nFebruary 22, 2019 · Updated July 10, 2020 · 137 Comments\nPin RecipeJump to Recipe\nThis post may contain affiliate links. Please read my disclosure policy.\n\nBaked French Fries are one of my family’s all-time favorites. My kids love oven fries even more than the store bought fries. Plus, oven baked fries are so much better for them.\n\nThese oven baked fries are perfect alongside a Jalapeño Cheddar Burgers, served up with Oven Fried Chicken or we even serve it with chicken and gravy!\n\nCrispy Oven Fries in a bowl\n\nOven Baked French Fries\nRusset potatoes are the gold standard for French fries in general. They especially suitable for baked fries, because the skins are thicker and dryer than the skins of other potatoes, so they crisp up nicely in the oven.\n\nHave you ever tried fries in the oven, and found they lack crispiness? Here are two great tips to avoid that problem forever!\n\nUncooked cut fries in a black & white towel\nHow to Make Oven French Fries Crispy\nAs deep fried french fries are often double fried (once at a lower temp, once at a higher temp to crisp) I’ve found the same thing works magically for oven fries! You can make oven french fries so good and crispy!\n\nSOAK: Soak the potatoes in cold water after cutting for at least 30 minutes.  This step removes a lot of starch (you will see it in the bowl after you remove them) resulting in a crispier French fry!\nDRY: This is really important. Make sure you dry them well so they don’t steam and get soft when they bake! I spin them in my salad spinner and then dap in a kitchen towel.\nOIL & SEASON: Use parchment paper to keep them from sticking and oil to make them crisp! While these are a version of healthy fries, if you want them to crisp, you will still need to be generous with the oil.\nTWO TEMP COOKING: This easy technique allows the fries to bake perfectly crispy! Simply bake at 375°F for a little bit to cook and then turn up the heat to really crisp them up!\nUncooked Crispy Oven Fries\nHow to Cut Potatoes into Fries\nI always leave the skin on because it adds a little bit extra fiber (and personally I like the way it tastes… and it’s easier).  If you prefer you can peel the potatoes first!\n\nYou can cut french fries by hand or save time using a French Fry cutter. I use a cutter for perfectly even fries.\n\nTo Cut into Steak Fries:\nSteak fries are typically thicker than french fries. To make baked steak fries, you’ll want to find potatoes that are a little bit smaller. Steak fries should be cut into small wedges about 3/4″ to 1″ thick.\nYou will follow the same cooking method below but for a longer period of time.\nHow to Bake French Fries\nTo achieve maximum crispiness in your homemade French fries, I do a 2 temperature cook:\n\nBe sure to preheat your oven to 375°F.\nDry the fries thoroughly after soaking and before seasoning.\nGenerously oil and season the oven fries. Spread evenly in a single layer on a parchment line pan.\nCook 20 minutes (25 for thicker fries).\nTurn the heat up to 425°F and continue baking until crisp, about 20 minutes.\nHow Long to Bake French Fries: Remember, thicker fries will take longer and if your fries are too thin, they’ll just burn without crisping.\n\nThe length of time for baked French fries will vary, depending on how thick you cut them and of course personal preference. My family likes them more tender crisp, I like them extra crispy!\n\n",
    "products": [
      74
    ]
  },
  {
    "name": "Chicken Nuggets",
    "image_name": "chickennuggets.jpg",
    "short_description": "McDonald’s Chicken Nuggets",
    "long_description": "INGREDIENTS\n3 chicken fillets, boneless, skin removed and diced\n\n1 ½ teaspoons salt\n\n2 large eggs\n\n1 ½ cups corn starch, divided\n\n1 cup water\n\n1 tablespoon onion powder\n\n1 tablespoon garlic powder\n\n2 tablespoons yellow mustard\n\n1 teaspoon ground black pepper\n\n1 cup all-purpose flour\n\nDIRECTIONS\nPlace the chicken in a food processor with the salt and one egg. Blend until it forms a paste-like consistency.\nIn a shallow bowl or container, place the corn starch. Using wet hands, take a handful of blended chicken and shape into a nugget. Cover the nugget with corn starch, shake off the excess and place on a parchment paper-lined baking sheet. Finish shaping and coating the nuggets before moving on to the next step.\nIn a large bowl, whisk together the water, one egg, mustard, garlic and onion powder, ground pepper and all-purpose flour. You should have a thick but runny batter. Place one nugget at a time in the batter and place it back onto the lined baking sheet.\nPlace the tray in the freezer and allow them to freeze for 1 hour.\nHeat your oil to 350 degrees Fahrenheit. Deep fry the first batch for 5 minutes. Allow the chicken nuggets to drain on paper towel for 3-4 minutes. Deep fry the same batch again for 5 minutes. This ensures that the chicken cooks all the way through without getting too dark.\nServe these nuggets warm with any dipping sauce.",
    "products": [
      33
    ]
  },
  {
    "name": "Lemonade",
    "image_name": "lemonade.jpg",
    "short_description": "Homemade lemonade",
    "long_description": "All you need to make this recipe is a great lemon juicer, a saucepan and a pitcher.\n\nSimmer 1 cup water and 1 1/2 cups sugar to dissolve the sugar. Cool to room temperature and chill.\nSqueeze 1 1/2 cups fresh lemon juice and refrigerate.\nTo serve: combine 7 cups cold water, chilled sugar syrup and chilled lemon juice. Serve over glasses filled with ice and garnish with lemon slices.\n",
    "products": [
      8
    ]
  },
  {
    "name": "Cinamon Apple Yoghurt",
    "image_name": "cinamonapple.webp",
    "short_description": "These Cinnamon Apple Yogurt Bowls are like having apple pie for breakfast, without the crust!",
    "long_description": "YOGURT BOWL VARIATIONS\nSwap the apples for pears.\nSwap the sugar for pure maple syrup.\nHOW TO MEAL PREP\nThe apples can be doubled for 4 servings to make ahead for the week. Let them cool to room temperature and refrigerated for up to 5 days. I like to pack them in portioned sized containers to make it easy. If packing them to go, pack the nuts in separate baggies so they don’t lose their crunch.",
    "products": [
      90,
      135,
      1
    ]
  }
]